Reports/СравнениеЗаказДоговораСМонтажами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>СравнениеЗаказДоговораСМонтажами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Монтаж</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комнаты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СравнениеЗаказДоговораСМонтажами/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ЗаказДоговор = Параметры.ЗаказДоговор;
	Отчет.Монтаж = Параметры.Монтаж;
	Отчет.Комнаты = Параметры.Комнаты;
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетСравнениеЗаказДоговораСМонтажами";
	
	Если Отчет.Комнаты.Количество() = 0 Тогда
		Если Отчет.Монтаж.Пустая() Тогда
			ВремКомнаты = Отчет.ЗаказДоговор.ТоварыУслуги.Выгрузить(,"Комната");
			ВремКомнаты.Свернуть("Комната");
			Для Каждого ВремСтрока Из ВремКомнаты Цикл
				Отчет.Комнаты.Добавить(ВремСтрока.Комната);
			КонецЦикла;
		Иначе
			ВремКомнаты = Отчет.Монтаж.ТоварыУслуги.Выгрузить(,"Комната");
			ВремКомнаты.Свернуть("Комната");
			Для Каждого ВремСтрока Из ВремКомнаты Цикл
				Отчет.Комнаты.Добавить(ВремСтрока.Комната);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаТоваровИУслуг = Новый ТаблицаЗначений;
	ТаблицаТоваровИУслуг.Колонки.Добавить("Комната");
	ТаблицаТоваровИУслуг.Колонки.Добавить("Номенклатура");
	ТаблицаТоваровИУслуг.Колонки.Добавить("УИСтроки");
	ТаблицаТоваровИУслуг.Колонки.Добавить("Количество");
	//++ №10821 единица и коэффициент, так же участвуют в сопоставлении
	ТаблицаТоваровИУслуг.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваровИУслуг.Колонки.Добавить("Коэффициент");
	//-- №10821
	ТаблицаТоваровИУслуг.Колонки.Добавить("Сумма");
	ТаблицаТоваровИУслуг.Колонки.Добавить("Цена");
	ТаблицаТоваровИУслуг.Колонки.Добавить("ПроцентСкидки");
	ТаблицаТоваровИУслуг.Колонки.Добавить("СуммаСкидки");
	ТаблицаТоваровИУслуг.Колонки.Добавить("КоличествоМ");
	ТаблицаТоваровИУслуг.Колонки.Добавить("ЦенаМ");
	ТаблицаТоваровИУслуг.Колонки.Добавить("ПроцентСкидкиМ");
	ТаблицаТоваровИУслуг.Колонки.Добавить("СуммаСкидкиМ");
	ТаблицаТоваровИУслуг.Колонки.Добавить("СуммаМ");
	
	Для Каждого СтрокаНоменклатуры Из Отчет.ЗаказДоговор.ТоварыУслуги Цикл
		Если НЕ Отчет.Комнаты.НайтиПоЗначению(СтрокаНоменклатуры.Комната) = Неопределено Тогда
			НоваяСтрока = ТаблицаТоваровИУслуг.Добавить();
			НоваяСтрока.УИСтроки = СтрокаНоменклатуры.УИСтроки;
			НоваяСтрока.Комната = СтрокаНоменклатуры.Комната;
			НоваяСтрока.Номенклатура = СтрокаНоменклатуры.Номенклатура;
			//++ №10821
			//НоваяСтрока.Количество = СтрокаНоменклатуры.Количество * СтрокаНоменклатуры.Коэффициент;
			НоваяСтрока.Количество = СтрокаНоменклатуры.Количество;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаНоменклатуры.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = СтрокаНоменклатуры.Коэффициент;
			//-- №10821
			НоваяСтрока.Сумма = СтрокаНоменклатуры.Сумма;
			НоваяСтрока.Цена = СтрокаНоменклатуры.Цена;
			НоваяСтрока.ПроцентСкидки = СтрокаНоменклатуры.ПроцентСкидки;
			НоваяСтрока.СуммаСкидки = СтрокаНоменклатуры.СуммаСкидки;
		КонецЕсли;
	КонецЦикла;
	
	//#9421 Поиск строк для проверки соответствия выполнять по ключу "Комната+Номенклатура+УИСтроки".
	//ТаблицаТоваровИУслуг.Свернуть("УИСтроки,Комната, Номенклатура, Цена, ПроцентСкидки","Количество, Сумма, СуммаСкидки, КоличествоМ, СуммаМ, ЦенаМ, ПроцентСкидкиМ, СуммаСкидкиМ");
	//ТаблицаТоваровИУслуг.Свернуть("УИСтроки, Комната, Номенклатура", "Количество, Цена, Сумма, ПроцентСкидки,СуммаСкидки, КоличествоМ, СуммаМ, ЦенаМ, ПроцентСкидкиМ, СуммаСкидкиМ");
	// №10821 добавлены ключи поиска единица и коэффициент
	ТаблицаТоваровИУслуг.Свернуть("УИСтроки, Комната, Номенклатура, ЕдиницаИзмерения, Коэффициент", "Количество, Цена, Сумма, ПроцентСкидки,СуммаСкидки, КоличествоМ, СуммаМ, ЦенаМ, ПроцентСкидкиМ, СуммаСкидкиМ");
	
	ТаблицаТоваровИУслуг.Колонки.Добавить("СписокМонтажей", Новый ОписаниеТипов("СписокЗначений"));
	ТаблицаТоваровИУслуг.Колонки.Добавить("ВыводитьВОтчет", Новый ОписаниеТипов("Булево"));
	
	ТаблицаМонтажей = Новый ТаблицаЗначений;
	ТаблицаМонтажей.Колонки.Добавить("Монтаж");
	Если Отчет.Монтаж.Пустая() Тогда
		Запрос = Новый Запрос;
		//Запрос.Текст = - из-за RLS выборку делаем из документов + этот регистр теперь больше не используется (раньше использовался в АРМ Розницы для формирования заголовков по фильтрам) 
		//"ВЫБРАТЬ 
		//|	ВыполнениеМонтажейПоДоговорамОбороты.Регистратор КАК Монтаж
		//|ИЗ
		//|	РегистрНакопления.ВыполнениеМонтажейПоДоговорам.Обороты(, , Регистратор, ЗаказДоговор = &ЗаказДоговор) КАК ВыполнениеМонтажейПоДоговорамОбороты";
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Монтажи.Ссылка КАК Монтаж
		|ИЗ
		|	Документ.Монтаж КАК Монтажи
		|ГДЕ
		|	Монтажи.Основание = &ЗаказДоговор
		|	И НЕ Монтажи.Результат = ЗНАЧЕНИЕ(Справочник.РезультатыМонтажа.Отменен)
		|	И НЕ Монтажи.ПометкаУдаления";
		Запрос.УстановитьПараметр("ЗаказДоговор", Отчет.ЗаказДоговор);
		ТаблицаМонтажей = Запрос.Выполнить().Выгрузить();
		
		//все строки ЗД выводим в отчет, т.к. отчет не по конкретному монтажу
		Для Каждого ТекСтрока Из ТаблицаТоваровИУслуг Цикл
			ТекСтрока.ВыводитьВОтчет = Истина;
		КонецЦикла;
	Иначе
		НоваяСтрока = ТаблицаМонтажей.Добавить();
		НоваяСтрока.Монтаж = Отчет.Монтаж;
	КонецЕсли;
					
	Для Каждого ТекущийМонтаж Из ТаблицаМонтажей Цикл
		Для Каждого СтрокаТоварыМонтажа Из ТекущийМонтаж.Монтаж.ТоварыУслуги Цикл
			
			Отбор = Новый Структура;
			// ищем по тем же полям, по которым сворачивали Заказ-договор
			Отбор.Вставить("Комната",СтрокаТоварыМонтажа.Комната);
			Отбор.Вставить("Номенклатура",СтрокаТоварыМонтажа.Номенклатура);
			Отбор.Вставить("УИСТроки",СтрокаТоварыМонтажа.УИСТроки);
			//Отбор.Вставить("Цена",СтрокаТоварыМонтажа.Цена);                    //#9421 закомментировано
			//Отбор.Вставить("ПроцентСкидки",СтрокаТоварыМонтажа.ПроцентСкидки);  //#9421 закомментировано
			
			//++ №10821 добавлены ключи
			Отбор.Вставить("ЕдиницаИзмерения", СтрокаТоварыМонтажа.ЕдиницаИзмерения);
			Отбор.Вставить("Коэффициент", СтрокаТоварыМонтажа.Коэффициент);
			//-- №10821
			
			НайденныеСтроки = ТаблицаТоваровИУслуг.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 тогда
				НайденныеСтроки[0].КоличествоМ = НайденныеСтроки[0].КоличествоМ + СтрокаТоварыМонтажа.Количество; // №10821 перемножать на коэффициент теперь не нужно *СтрокаТоварыМонтажа.Коэффициент;
				НайденныеСтроки[0].СуммаМ = НайденныеСтроки[0].СуммаМ + СтрокаТоварыМонтажа.Сумма;
				НайденныеСтроки[0].ЦенаМ = СтрокаТоварыМонтажа.Цена;
				НайденныеСтроки[0].ПроцентСкидкиМ = СтрокаТоварыМонтажа.ПроцентСкидки;
				НайденныеСтроки[0].СуммаСкидкиМ = НайденныеСтроки[0].СуммаСкидкиМ + СтрокаТоварыМонтажа.СуммаСкидки;
				НайденныеСтроки[0].СписокМонтажей.Добавить(ТекущийМонтаж.Монтаж);
				НайденныеСтроки[0].ВыводитьВОтчет = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Таб = Новый ТабличныйДокумент;
	ТекОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ТекОтчет.ПолучитьМакет("Макет");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.ЗаказДоговор = Отчет.ЗаказДоговор;
	Таб.Вывести(ОбластьМакета);
	
	// #16346 проверяем также вид операции
	ВидСоответствует = Истина;
	Если ЗначениеЗаполнено(Отчет.Монтаж)  Тогда
		ВидОперацииМонтажа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.Монтаж, "ВидОперации");
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.ЗаказДоговор) Тогда
		ВидЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.ЗаказДоговор, "ВидЗаказа");
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Монтаж) И ЗначениеЗаполнено(Отчет.ЗаказДоговор) Тогда	
		Если НЕ ВидОперацииМонтажа = Справочники.ВидыМонтажа.Продажа Тогда			
			СоответствующийВидОперацииМонтажа = ОбщийМодульСервер.ВидОперацииМонтажаПоВидуЗаказа(ВидЗаказа);
			Если НЕ ВидОперацииМонтажа = СоответствующийВидОперацииМонтажа Тогда
				ВидСоответствует = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ВидСоответствует Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогДокументовВидДа"); 
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогДокументовВидНет");
	КонецЕсли;
	ОбластьМакета.Параметры.ВидЗаказа = ВидЗаказа;
	ОбластьМакета.Параметры.ВидОперацииМонтажа = ВидОперацииМонтажа;
	Таб.Вывести(ОбластьМакета);
	
	
	СуммаЗД = ТаблицаТоваровИУслуг.Итог("Сумма"); 
	СуммаМонтажей = ТаблицаТоваровИУслуг.Итог("СуммаМ");
	Если СуммаЗД = СуммаМонтажей Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогДокументовДа"); 
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогДокументовНет");
	КонецЕсли;
	ОбластьМакета.Параметры.СуммаЗД = СуммаЗД;
	ОбластьМакета.Параметры.СуммаМонтажей = СуммаМонтажей;
	Таб.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаДокументов");
	Таб.Вывести(ОбластьМакета);
	
	ТаблицаКомнат = ТаблицаТоваровИУслуг.Скопировать();
	ТаблицаКомнат.Свернуть("Комната","Сумма, СуммаМ"); 
	
	Для Каждого ТекущаяКомната Из ТаблицаКомнат Цикл
		Для Каждого ТекущаяСтрока Из ТаблицаТоваровИУслуг ЦИкл
			Если НЕ ТекущаяКомната.Комната = ТекущаяСтрока.Комната Тогда
				Продолжить;
			КонецЕсли;
			//Если ТекущаяСтрока.ВыводитьВОтчет Тогда
				СтрокаДа = Ложь;
				Если ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоМ 
					И ТекущаяСтрока.Сумма = ТекущаяСтрока.СуммаМ 
					И ТекущаяСтрока.Цена = ТекущаяСтрока.ЦенаМ 
					И ТекущаяСтрока.ПроцентСкидки = ТекущаяСтрока.ПроцентСкидкиМ 
					И ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.СуммаСкидкиМ 
					Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДа");
					СтрокаДа = Истина;
				Иначе
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаНет");
					СтрокаДа = Ложь;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
				ОбластьМакета.Параметры.ЗаказДоговор = Отчет.ЗаказДоговор;
				Если ТекущаяСтрока.СписокМонтажей.Количество() > 0 тогда
					ОбластьМакета.Параметры.Монтаж = ТекущаяСтрока.СписокМонтажей[0].Значение;
					ОбластьМакета.Параметры.ТекущийСтатус = ТекущаяСтрока.СписокМонтажей[0].Значение.Результат;
					
					Таб.Вывести(ОбластьМакета);
					
					Для НомерМонтажа = 1 По ТекущаяСтрока.СписокМонтажей.Количество()-1 Цикл
						Если СтрокаДа Тогда
							ОбластьМонтаж = Макет.ПолучитьОбласть("СтрокаМонтажДа");
						Иначе
							ОбластьМонтаж = Макет.ПолучитьОбласть("СтрокаМонтажНет");
						КонецЕсли;
						ОбластьМонтаж.Параметры.Монтаж = ТекущаяСтрока.СписокМонтажей[НомерМонтажа].Значение;
						ОбластьМонтаж.Параметры.ТекущийСтатус = ТекущаяСтрока.СписокМонтажей[НомерМонтажа].Значение.Результат;
						Таб.Вывести(ОбластьМонтаж);
					КонецЦикла;
				Иначе
					Таб.Вывести(ОбластьМакета);
				КонецЕсли;
			//КонецЕсли;
		КонецЦикла;
		
		Если ТекущаяКомната.Сумма = ТекущаяКомната.СуммаМ Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКомнатаДа"); 
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКомнатаНет");
		КонецЕсли;
		ОбластьМакета.Параметры.Комната = ТекущаяКомната.Комната;
		ОбластьМакета.Параметры.СуммаЗД = ТекущаяКомната.Сумма;
		ОбластьМакета.Параметры.СуммаМонтажей = ТекущаяКомната.СуммаМ;
		Таб.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Результат.Вывести(Таб);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры
